In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [31]:
dframe=DataFrame({'K1':['X','X','Y','Y','Z'],
                   'K2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':[2,4,6,8,10],
                   'dataset2':[3,6,9,12,15]})

dframe

  K1     K2  dataset1  dataset2
0  X  alpha         2         3
1  X   beta         4         6
2  Y  alpha         6         9
3  Y   beta         8        12
4  Z  alpha        10        15

In [35]:
group1 = dframe['dataset1'].groupby(dframe['K1'])

In [36]:
group1

In [37]:
group1.mean()

K1
X     3
Y     7
Z    10
Name: dataset1, dtype: int64

In [38]:
cities=np.array(['NY','LA','LA','NY','NY'])
month=np.array(['JAN','FEB','JAN','FEB','JAN'])

In [40]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    4
    JAN    6
NY  FEB    8
    JAN    6
Name: dataset1, dtype: int64

In [41]:
dframe

  K1     K2  dataset1  dataset2
0  X  alpha         2         3
1  X   beta         4         6
2  Y  alpha         6         9
3  Y   beta         8        12
4  Z  alpha        10        15

In [42]:
dframe.groupby('K1').mean()

    dataset1  dataset2
K1
X        3.0       4.5
Y        7.0      10.5
Z       10.0      15.0

In [43]:
dframe.groupby(['K1','K2']).mean()

          dataset1  dataset2
K1 K2
X  alpha         2         3
   beta          4         6
Y  alpha         6         9
   beta          8        12
Z  alpha        10        15

In [44]:
dframe.groupby(['K1']).size()

K1
X    2
Y    2
Z    1
dtype: int64

In [45]:
dframe

  K1     K2  dataset1  dataset2
0  X  alpha         2         3
1  X   beta         4         6
2  Y  alpha         6         9
3  Y   beta         8        12
4  Z  alpha        10        15

In [50]:
for name,group in dframe.groupby('K1'):
    print ("This is the %s group" %name)
    print (group)
    print ("\n")

This is the X group
  K1     K2  dataset1  dataset2
0  X  alpha         2         3
1  X   beta         4         6


This is the Y group
  K1     K2  dataset1  dataset2
2  Y  alpha         6         9
3  Y   beta         8        12


This is the Z group
  K1     K2  dataset1  dataset2
4  Z  alpha        10        15

In [47]:
for (K1,K2), group in dframe.groupby(['K1','K2']):
    print ("Key1 = %s key2 %s"%(K1,K2))
    print (group)
    print ("\n")

Key1 = X key2 alpha
  K1     K2  dataset1  dataset2
0  X  alpha         2         3


Key1 = X key2 beta
  K1    K2  dataset1  dataset2
1  X  beta         4         6


Key1 = Y key2 alpha
  K1     K2  dataset1  dataset2
2  Y  alpha         6         9


Key1 = Y key2 beta
  K1    K2  dataset1  dataset2
3  Y  beta         8        12


Key1 = Z key2 alpha
  K1     K2  dataset1  dataset2
4  Z  alpha        10        15

In [21]:
group_dict=dict(list(dframe.groupby('K1')))

In [23]:
group_dict['X']

  K1     K2  dataset1  dataset2
0  X  alpha -0.986211 -1.567495
1  X   beta  0.263508 -1.553920

In [26]:
group_dict_axis1=dict(list(dframe.groupby(dframe.dtypes,axis=1)))

group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.986211 -1.567495
 1  0.263508 -1.553920
 2  0.542359  0.007825
 3 -0.383757  0.427863
 4  0.150780  0.695325, dtype('O'):   K1     K2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [27]:
dataset2_group = dframe.groupby(['K1','K2'])[['dataset2']]

dataset2_group.mean()

          dataset2
K1 K2
X  alpha -1.567495
   beta  -1.553920
Y  alpha  0.007825
   beta   0.427863
Z  alpha  0.695325